In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [9]:
data.isnull().sum()

2

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.isnull().sum()]

3.5

In [12]:
data[True]

KeyError: True

In [13]:
data = pd.DataFrame([[1.,6.5,3.],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = np.nan

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.023352  0.535740 -0.306770
1  0.483606 -0.466916  0.045198
2 -0.171230  0.473998  0.717820
3  0.356298 -0.673946  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [22]:
df.iloc[:4]

          0         1         2
0  1.023352  0.535740 -0.306770
1  0.483606 -0.466916  0.045198
2 -0.171230  0.473998  0.717820
3  0.356298 -0.673946  0.032102

In [23]:
df.iloc[:2,2]

0   -0.306770
1    0.045198
Name: 2, dtype: float64

In [24]:
df.loc[:3]

          0         1         2
0  1.023352  0.535740 -0.306770
1  0.483606 -0.466916  0.045198
2 -0.171230  0.473998  0.717820
3  0.356298 -0.673946  0.032102

In [25]:
df.iloc[:4,1] = np.nan

In [26]:
df

          0         1         2
0  1.023352       NaN -0.306770
1  0.483606       NaN  0.045198
2 -0.171230       NaN  0.717820
3  0.356298       NaN  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [27]:
df.iloc[:2,2] = np.nan
df

          0         1         2
0  1.023352       NaN       NaN
1  0.483606       NaN       NaN
2 -0.171230       NaN  0.717820
3  0.356298       NaN  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [28]:
df.dropna()

          0         1         2
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [29]:
df

          0         1         2
0  1.023352       NaN       NaN
1  0.483606       NaN       NaN
2 -0.171230       NaN  0.717820
3  0.356298       NaN  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [30]:
df.dropna(thresh=2)

          0         1         2
2 -0.171230       NaN  0.717820
3  0.356298       NaN  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [31]:
df.dropna(thresh = 3)

          0         1         2
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [32]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [33]:
df.fillna(0)

          0         1         2
0  1.023352  0.000000  0.000000
1  0.483606  0.000000  0.000000
2 -0.171230  0.000000  0.717820
3  0.356298  0.000000  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [35]:
df.fillna({1:0.5,2:2.5})

          0         1         2
0  1.023352  0.500000  2.500000
1  0.483606  0.500000  2.500000
2 -0.171230  0.500000  0.717820
3  0.356298  0.500000  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [36]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.023352  0.000000  0.000000
1  0.483606  0.000000  0.000000
2 -0.171230  0.000000  0.717820
3  0.356298  0.000000  0.032102
4  0.225171 -1.019817  0.230781
5  1.222428  1.299007  1.450841
6  1.202628  2.356898  1.330279

In [37]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.042955  1.107189  0.961391
1  0.530631 -0.938510  1.547042
2  0.781103  0.320083 -0.291070
3 -0.043430 -1.159249  0.268306
4  1.094817  0.885267 -2.761830
5 -0.186487  0.541745 -0.899589

In [38]:
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan
df

          0         1         2
0 -0.042955  1.107189  0.961391
1  0.530631 -0.938510  1.547042
2  0.781103       NaN -0.291070
3 -0.043430       NaN  0.268306
4  1.094817       NaN       NaN
5 -0.186487       NaN       NaN

In [39]:
df.fillna(method='ffill')

          0         1         2
0 -0.042955  1.107189  0.961391
1  0.530631 -0.938510  1.547042
2  0.781103 -0.938510 -0.291070
3 -0.043430 -0.938510  0.268306
4  1.094817 -0.938510  0.268306
5 -0.186487 -0.938510  0.268306

In [40]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.042955  1.107189  0.961391
1  0.530631 -0.938510  1.547042
2  0.781103 -0.938510 -0.291070
3 -0.043430 -0.938510  0.268306
4  1.094817       NaN  0.268306
5 -0.186487       NaN  0.268306

In [41]:
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [42]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [43]:
data = pd.DataFrame({'k1':['one','two']*3 +['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool